# WallAttrRoomBounding Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallAttrRoomBounding Property
ParameterTypeId Class See Also
---
"Room Bounding"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallAttrRoomBounding { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallAttrRoomBounding As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallAttrRoomBounding {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace